app/views/models/_types.mobile.erb

<% @model.types.each do |type| %>
---
SELECT `types`.* FROM `types` WHERE (`types`.model_id = 2)