app/views/vehicles/_brands.mobile.erb

SELECT `brands`.* FROM `brands` WHERE (`brands`.vehicle_id = 1) ORDER BY title asc
---
<% @vehicle.brands.order('title asc').each do |brand| %>