app/views/brands/_brands.html.erb

<% @brand.models.order('title asc').each do |mdl| %>
---
SELECT `models`.* FROM `models` WHERE (`models`.brand_id = 4) ORDER BY title asc