app/views/brands/_brands.mobile.erb

SELECT `models`.* FROM `models` WHERE (`models`.brand_id = 4) ORDER BY title asc
---
<% @brand.models.order('title asc').each do |mdl| %>